```
=========> Existing resources:
1.13.5
Acquiring state lock. This may take a few moments...
module.acr.module.public_ip.data.curl.big_data_cloud: Reading...
module.acr.module.public_ip.data.curl.big_data_cloud: Read complete after 0s [id=1762491222]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "avmtelemetry"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "avm-telemetry"
      + retention_policy              = (known after apply)
      + sku                           = "Premium"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_container_registry_token.pull will be created
  + resource "azurerm_container_registry_token" "pull" {
      + container_registry_name = "avmtelemetry"
      + enabled                 = true
      + id                      = (known after apply)
      + name                    = "pull-token"
      + resource_group_name     = "avm-telemetry"
      + scope_map_id            = (known after apply)
    }

  # module.acr.azurerm_container_registry_token.push will be created
  + resource "azurerm_container_registry_token" "push" {
      + container_registry_name = "avmtelemetry"
      + enabled                 = true
      + id                      = (known after apply)
      + name                    = "push-token"
      + resource_group_name     = "avm-telemetry"
      + scope_map_id            = (known after apply)
    }

  # module.acr.azurerm_container_registry_token_password.pull_password will be created
  + resource "azurerm_container_registry_token_password" "pull_password" {
      + container_registry_token_id = (known after apply)
      + id                          = (known after apply)

      + password1 {
          + value = (sensitive value)
        }
    }

  # module.acr.azurerm_container_registry_token_password.push_password will be created
  + resource "azurerm_container_registry_token_password" "push_password" {
      + container_registry_token_id = (known after apply)
      + id                          = (known after apply)

      + password1 {
          + value = (sensitive value)
        }
    }

  # module.acr.azurerm_private_dns_a_record.data will be created
  + resource "azurerm_private_dns_a_record" "data" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "avmtelemetry.eastus.data"
      + records             = (known after apply)
      + resource_group_name = "avm-telemetry"
      + ttl                 = 3600
      + zone_name           = "privatelink.azurecr.io"
    }

  # module.acr.azurerm_private_dns_a_record.login_server will be created
  + resource "azurerm_private_dns_a_record" "login_server" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "avmtelemetry"
      + records             = (known after apply)
      + resource_group_name = "avm-telemetry"
      + ttl                 = 3600
      + zone_name           = "privatelink.azurecr.io"
    }

  # module.acr.azurerm_private_dns_zone.pdz will be created
  + resource "azurerm_private_dns_zone" "pdz" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "avm-telemetry"

      + soa_record (known after apply)
    }

  # module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink_private" {
      + id                    = (known after apply)
      + name                  = "mydnslink"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "avm-telemetry"
      + virtual_network_id    = (known after apply)
    }

  # module.acr.azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "mype"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "avm-telemetry"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "countainerregistryprivatelink"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.acr.azurerm_subnet.acr will be created
  + resource "azurerm_subnet" "acr" {
      + address_prefixes                               = [
          + "192.168.0.0/23",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acr"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "avm-telemetry"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "telemetry"
    }

  # module.acr.azurerm_subnet.container_apps will be created
  + resource "azurerm_subnet" "container_apps" {
      + address_prefixes                               = [
          + "192.168.2.0/23",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "containerapps"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "avm-telemetry"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "telemetry"
    }

  # module.acr.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "telemetry"
      + resource_group_name = "avm-telemetry"
      + subnet              = (known after apply)
    }

  # module.container_apps.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "ai-avm-telemetry"
      + resource_group_name                   = "avm-telemetry"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + workspace_id                          = (known after apply)
    }

  # module.container_apps.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "law-avm-telemetry"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "avm-telemetry"
      + retention_in_days               = 730
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = (known after apply)
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "d50ae297497a1714fc0afadcd02d32fa"
          + "dockerfile" = "55bd302135967045970190be50f8eeb0"
        }

      + build {
          + cache_from     = []
          + context        = "docker_image"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = (known after apply)
            # (13 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = (known after apply)
      + sha256_digest        = (known after apply)
    }

  # module.docker_image.null_resource.go_code_keeper will be created
  + resource "null_resource" "go_code_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "code_hash"  = "d50ae297497a1714fc0afadcd02d32fa"
          + "dockerfile" = "55bd302135967045970190be50f8eeb0"
          + "go_mod"     = "23f74f085d2661e78a3a2d2588c49321"
          + "go_sum"     = "b8ea6d50c255dcec9d2fd07d2bf53b1d"
        }
    }

  # module.endpoint_blob.azurerm_storage_account.endpoint will be created
  + resource "azurerm_storage_account" "endpoint" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "avmtftelemetrysvc2"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "avm-telemetry"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.endpoint_blob.azurerm_storage_blob.endpoint will be created
  + resource "azurerm_storage_blob" "endpoint" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "endpoint"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "avmtftelemetrysvc2"
      + storage_container_name = "blob"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.endpoint_blob.azurerm_storage_container.endpoint will be created
  + resource "azurerm_storage_container" "endpoint" {
      + container_access_type             = "blob"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "blob"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "avmtftelemetrysvc2"
    }

  # module.resource_group.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "avm-telemetry"
      + tags     = {
          + "do_not_delete" = null
          + "env"           = "prod"
        }
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"] will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "telemetry-proxy"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "avm-telemetry"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "secname"
          + server               = (known after apply)
          + username             = "pull-token"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = (known after apply)
              + memory            = "0.5Gi"
              + name              = "telemetry-proxy"

              + env {
                  + name  = "DIAG"
                  + value = "1"
                }
              + env {
                  + name        = "INSTRUMENTATION_KEY"
                  + secret_name = "ikey"
                }
              + env {
                  + name  = "PORT"
                  + value = "8080"
                }
              + env {
                  + name  = "SOURCE_REGEX_0"
                  + value = "registry.terraform.io/[A|a]zure/.+"
                }
              + env {
                  + name  = "SOURCE_REGEX_1"
                  + value = "registry.opentofu.org/[A|a]zure/.+"
                }
              + env {
                  + name  = "SOURCE_REGEX_2"
                  + value = "git::https://github\\.com/[A|a]zure/.+"
                }
              + env {
                  + name  = "SOURCE_REGEX_3"
                  + value = "git::ssh:://git@github\\.com/[A|a]zure/.+"
                }
            }
        }
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env will be created
  + resource "azurerm_container_app_environment" "container_env" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "telemetry-proxy"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "avm-telemetry"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

  # module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0] will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + cmk_for_query_forced            = false
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "telemetry-proxy-log-analytics-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "avm-telemetry"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint_blob_url = (known after apply)

Warning: Argument is deprecated

  with module.acr.azurerm_subnet.acr,
  on acr/main.tf line 72, in resource "azurerm_subnet" "acr":
  72:   private_endpoint_network_policies_enabled     = false

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```